PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1779.inc
;----- PRG3RTSS Bits -----------------------------------------------------
RTSS0            EQU  H'0000'
RTSS1            EQU  H'0001'
RTSS2            EQU  H'0002'
RTSS3            EQU  H'0003'

RG3RTSS0         EQU  H'0000'
RG3RTSS1         EQU  H'0001'
RG3RTSS2         EQU  H'0002'
RG3RTSS3         EQU  H'0003'


;----- PRG3FTSS Bits -----------------------------------------------------
FTSS0            EQU  H'0000'
FTSS1            EQU  H'0001'
FTSS2            EQU  H'0002'
FTSS3            EQU  H'0003'

RG3FTSS0         EQU  H'0000'
RG3FTSS1         EQU  H'0001'
RG3FTSS2         EQU  H'0002'
RG3FTSS3         EQU  H'0003'


;----- PRG3INS Bits -----------------------------------------------------
INS0             EQU  H'0000'
INS1             EQU  H'0001'
INS2             EQU  H'0002'
INS3             EQU  H'0003'

RG3INS0          EQU  H'0000'
RG3INS1          EQU  H'0001'
RG3INS2          EQU  H'0002'
RG3INS3          EQU  H'0003'


;----- PRG3CON0 Bits -----------------------------------------------------
GO_PRG3CON0      EQU  H'0000'
OS               EQU  H'0001'
REDG             EQU  H'0004'
FEDG             EQU  H'0005'
EN               EQU  H'0007'

MODE0_PRG3CON0   EQU  H'0002'
MODE1_PRG3CON0   EQU  H'0003'

RG3GO            EQU  H'0000'
RG3OS            EQU  H'0001'
RG3REDG          EQU  H'0004'
RG3FEDG          EQU  H'0005'
RG3EN            EQU  H'0007'

RG3MODE0         EQU  H'0002'
RG3MODE1         EQU  H'0003'


;----- PRG3CON1 Bits -----------------------------------------------------
RPOL             EQU  H'0000'
FPOL             EQU  H'0001'
RDY              EQU  H'0002'

RG3RPOL          EQU  H'0000'
RG3FPOL          EQU  H'0001'
RG3RDY           EQU  H'0002'


;----- PRG3CON2 Bits -----------------------------------------------------
ISET0            EQU  H'0000'
ISET1            EQU  H'0001'
ISET2            EQU  H'0002'
ISET3            EQU  H'0003'
ISET4            EQU  H'0004'


RG3ISET0         EQU  H'0000'
RG3ISET1         EQU  H'0001'
RG3ISET2         EQU  H'0002'
RG3ISET3         EQU  H'0003'
RG3ISET4         EQU  H'0004'


;----- COG3PHR Bits -----------------------------------------------------
PHR0             EQU  H'0000'
PHR1             EQU  H'0001'
PHR2             EQU  H'0002'
PHR3             EQU  H'0003'
PHR4             EQU  H'0004'
PHR5             EQU  H'0005'

G3PHR0           EQU  H'0000'
G3PHR1           EQU  H'0001'
G3PHR2           EQU  H'0002'
G3PHR3           EQU  H'0003'
G3PHR4           EQU  H'0004'
G3PHR5           EQU  H'0005'


;----- COG3PHF Bits -----------------------------------------------------
PHF0             EQU  H'0000'
PHF1             EQU  H'0001'
PHF2             EQU  H'0002'
PHF3             EQU  H'0003'
PHF4             EQU  H'0004'
PHF5             EQU  H'0005'

G3PHF0           EQU  H'0000'
G3PHF1           EQU  H'0001'
G3PHF2           EQU  H'0002'
G3PHF3           EQU  H'0003'
G3PHF4           EQU  H'0004'
G3PHF5           EQU  H'0005'


;----- COG3BLKR Bits -----------------------------------------------------
BLKR0            EQU  H'0000'
BLKR1            EQU  H'0001'
BLKR2            EQU  H'0002'
BLKR3            EQU  H'0003'
BLKR4            EQU  H'0004'
BLKR5            EQU  H'0005'

G3BLKR0          EQU  H'0000'
G3BLKR1          EQU  H'0001'
G3BLKR2          EQU  H'0002'
G3BLKR3          EQU  H'0003'
G3BLKR4          EQU  H'0004'
G3BLKR5          EQU  H'0005'


;----- COG3BLKF Bits -----------------------------------------------------
BLKF0            EQU  H'0000'
BLKF1            EQU  H'0001'
BLKF2            EQU  H'0002'
BLKF3            EQU  H'0003'
BLKF4            EQU  H'0004'
BLKF5            EQU  H'0005'

G3BLKF0          EQU  H'0000'
G3BLKF1          EQU  H'0001'
G3BLKF2          EQU  H'0002'
G3BLKF3          EQU  H'0003'
G3BLKF4          EQU  H'0004'
G3BLKF5          EQU  H'0005'


;----- COG3DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'

G3DBR0           EQU  H'0000'
G3DBR1           EQU  H'0001'
G3DBR2           EQU  H'0002'
G3DBR3           EQU  H'0003'
G3DBR4           EQU  H'0004'
G3DBR5           EQU  H'0005'


;----- COG3DBF Bits -----------------------------------------------------
DBF0             EQU  H'0000'
DBF1             EQU  H'0001'
DBF2             EQU  H'0002'
DBF3             EQU  H'0003'
DBF4             EQU  H'0004'
DBF5             EQU  H'0005'

G3DBF0           EQU  H'0000'
G3DBF1           EQU  H'0001'
G3DBF2           EQU  H'0002'
G3DBF3           EQU  H'0003'
G3DBF4           EQU  H'0004'
G3DBF5           EQU  H'0005'



;----- COG3CON0 Bits -----------------------------------------------------
LD               EQU  H'0006'
EN               EQU  H'0007'

MD0              EQU  H'0000'
MD1              EQU  H'0001'
MD2              EQU  H'0002'
CS0_COG3CON0     EQU  H'0003'
CS1_COG3CON0     EQU  H'0004'

G3LD             EQU  H'0006'
G3EN             EQU  H'0007'

G3MD0            EQU  H'0000'
G3MD1            EQU  H'0001'
G3MD2            EQU  H'0002'
G3CS0            EQU  H'0003'
G3CS1            EQU  H'0004'


;----- COG3CON1 Bits -----------------------------------------------------
POLA             EQU  H'0000'
POLB             EQU  H'0001'
POLC             EQU  H'0002'
POLD             EQU  H'0003'
FDBS             EQU  H'0006'
RDBS             EQU  H'0007'

G3POLA           EQU  H'0000'
G3POLB           EQU  H'0001'
G3POLC           EQU  H'0002'
G3POLD           EQU  H'0003'
G3FDBS           EQU  H'0006'
G3RDBS           EQU  H'0007'


;----- COG3RIS0 Bits -----------------------------------------------------
RIS0             EQU  H'0000'
RIS1             EQU  H'0001'
RIS2             EQU  H'0002'
RIS3             EQU  H'0003'
RIS4             EQU  H'0004'
RIS5             EQU  H'0005'
RIS6             EQU  H'0006'
RIS7             EQU  H'0007'

G3RIS0           EQU  H'0000'
G3RIS1           EQU  H'0001'
G3RIS2           EQU  H'0002'
G3RIS3           EQU  H'0003'
G3RIS4           EQU  H'0004'
G3RIS5           EQU  H'0005'
G3RIS6           EQU  H'0006'
G3RIS7           EQU  H'0007'


;----- COG3RIS1 Bits -----------------------------------------------------
RIS9             EQU  H'0001'
RIS11            EQU  H'0003'
RIS12            EQU  H'0004'
RIS13            EQU  H'0005'
RIS14            EQU  H'0006'
RIS15            EQU  H'0007'

