PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1779.inc
LDS0             EQU  H'0000'
LDS1             EQU  H'0001'


;----- PWM11OFCON Bits -----------------------------------------------------
OFO              EQU  H'0004'

PWM11OFS0        EQU  H'0000'
PWM11OFS1        EQU  H'0001'
PWM11OFM0        EQU  H'0005'
PWM11OFM1        EQU  H'0006'

PWM11OFMC        EQU  H'0004'

OFS0             EQU  H'0000'
OFS1             EQU  H'0001'
OFM0             EQU  H'0005'
OFM1             EQU  H'0006'


;----- PWM12PHL Bits -----------------------------------------------------
PWM12PHL0        EQU  H'0000'
PWM12PHL1        EQU  H'0001'
PWM12PHL2        EQU  H'0002'
PWM12PHL3        EQU  H'0003'
PWM12PHL4        EQU  H'0004'
PWM12PHL5        EQU  H'0005'
PWM12PHL6        EQU  H'0006'
PWM12PHL7        EQU  H'0007'



;----- PWM12PHH Bits -----------------------------------------------------
PWM12PHH0        EQU  H'0000'
PWM12PHH1        EQU  H'0001'
PWM12PHH2        EQU  H'0002'
PWM12PHH3        EQU  H'0003'
PWM12PHH4        EQU  H'0004'
PWM12PHH5        EQU  H'0005'
PWM12PHH6        EQU  H'0006'
PWM12PHH7        EQU  H'0007'



;----- PWM12DCL Bits -----------------------------------------------------
PWM12DCL0        EQU  H'0000'
PWM12DCL1        EQU  H'0001'
PWM12DCL2        EQU  H'0002'
PWM12DCL3        EQU  H'0003'
PWM12DCL4        EQU  H'0004'
PWM12DCL5        EQU  H'0005'
PWM12DCL6        EQU  H'0006'
PWM12DCL7        EQU  H'0007'



;----- PWM12DCH Bits -----------------------------------------------------
PWM12DCH0        EQU  H'0000'
PWM12DCH1        EQU  H'0001'
PWM12DCH2        EQU  H'0002'
PWM12DCH3        EQU  H'0003'
PWM12DCH4        EQU  H'0004'
PWM12DCH5        EQU  H'0005'
PWM12DCH6        EQU  H'0006'
PWM12DCH7        EQU  H'0007'



;----- PWM12PRL Bits -----------------------------------------------------
PWM12PRL0        EQU  H'0000'
PWM12PRL1        EQU  H'0001'
PWM12PRL2        EQU  H'0002'
PWM12PRL3        EQU  H'0003'
PWM12PRL4        EQU  H'0004'
PWM12PRL5        EQU  H'0005'
PWM12PRL6        EQU  H'0006'
PWM12PRL7        EQU  H'0007'



;----- PWM12PRH Bits -----------------------------------------------------
PWM12PRH0        EQU  H'0000'
PWM12PRH1        EQU  H'0001'
PWM12PRH2        EQU  H'0002'
PWM12PRH3        EQU  H'0003'
PWM12PRH4        EQU  H'0004'
PWM12PRH5        EQU  H'0005'
PWM12PRH6        EQU  H'0006'
PWM12PRH7        EQU  H'0007'



;----- PWM12OFL Bits -----------------------------------------------------
PWM12OFL0        EQU  H'0000'
PWM12OFL1        EQU  H'0001'
PWM12OFL2        EQU  H'0002'
PWM12OFL3        EQU  H'0003'
PWM12OFL4        EQU  H'0004'
PWM12OFL5        EQU  H'0005'
PWM12OFL6        EQU  H'0006'
PWM12OFL7        EQU  H'0007'



;----- PWM12OFH Bits -----------------------------------------------------
PWM12OFH0        EQU  H'0000'
PWM12OFH1        EQU  H'0001'
PWM12OFH2        EQU  H'0002'
PWM12OFH3        EQU  H'0003'
PWM12OFH4        EQU  H'0004'
PWM12OFH5        EQU  H'0005'
PWM12OFH6        EQU  H'0006'
PWM12OFH7        EQU  H'0007'



;----- PWM12TMRL Bits -----------------------------------------------------
PWM12TMRL0       EQU  H'0000'
PWM12TMRL1       EQU  H'0001'
PWM12TMRL2       EQU  H'0002'
PWM12TMRL3       EQU  H'0003'
PWM12TMRL4       EQU  H'0004'
PWM12TMRL5       EQU  H'0005'
PWM12TMRL6       EQU  H'0006'
PWM12TMRL7       EQU  H'0007'



;----- PWM12TMRH Bits -----------------------------------------------------
PWM12TMRH0       EQU  H'0000'
PWM12TMRH1       EQU  H'0001'
PWM12TMRH2       EQU  H'0002'
PWM12TMRH3       EQU  H'0003'
PWM12TMRH4       EQU  H'0004'
PWM12TMRH5       EQU  H'0005'
PWM12TMRH6       EQU  H'0006'
PWM12TMRH7       EQU  H'0007'



;----- PWM12CON Bits -----------------------------------------------------
POL_PWM12CON     EQU  H'0004'
OUT_PWM12CON     EQU  H'0005'
EN               EQU  H'0007'

PWM12MODE0       EQU  H'0002'
PWM12MODE1       EQU  H'0003'

PWM12POL         EQU  H'0004'
PWM12OUT         EQU  H'0005'
PWM12EN          EQU  H'0007'

MODE0_PWM12CON   EQU  H'0002'
MODE1_PWM12CON   EQU  H'0003'


;----- PWM12INTCON Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM12PRIE        EQU  H'0000'
PWM12DCIE        EQU  H'0001'
PWM12PHIE        EQU  H'0002'
PWM12OFIE        EQU  H'0003'


;----- PWM12INTE Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM12PRIE        EQU  H'0000'
PWM12DCIE        EQU  H'0001'
PWM12PHIE        EQU  H'0002'
PWM12OFIE        EQU  H'0003'


;----- PWM12INTF Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM12PRIF        EQU  H'0000'
PWM12DCIF        EQU  H'0001'
PWM12PHIF        EQU  H'0002'
PWM12OFIF        EQU  H'0003'


;----- PWM12INTFLG Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM12PRIF        EQU  H'0000'
PWM12DCIF        EQU  H'0001'
PWM12PHIF        EQU  H'0002'
PWM12OFIF        EQU  H'0003'


;----- PWM12CLKCON Bits -----------------------------------------------------
PWM12CS0         EQU  H'0000'
PWM12CS1         EQU  H'0001'
PWM12CS2         EQU  H'0002'
PWM12PS0         EQU  H'0004'
PWM12PS1         EQU  H'0005'
PWM12PS2         EQU  H'0006'


CS0_PWM12CLKCON  EQU  H'0000'
CS1_PWM12CLKCON  EQU  H'0001'
CS2              EQU  H'0002'
PS0_PWM12CLKCON  EQU  H'0004'
PS1_PWM12CLKCON  EQU  H'0005'
PS2_PWM12CLKCON  EQU  H'0006'


;----- PWM12LDCON Bits -----------------------------------------------------
LDT              EQU  H'0006'
LDA              EQU  H'0007'

PWM12LDS0        EQU  H'0000'
PWM12LDS1        EQU  H'0001'

PWM12LDM         EQU  H'0006'
PWM12LD          EQU  H'0007'

LDS0             EQU  H'0000'
LDS1             EQU  H'0001'


;----- PWM12OFCON Bits -----------------------------------------------------
OFO              EQU  H'0004'

